### Terraform Plan 📜
```
[command]/home/runner/work/_temp/f8a32639-4895-4b6e-8961-f9da24deb938/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web will be updated in-place
  ~ resource "aws_instance" "web" {
        id                                   = "i-09e147c3c46d08b03"
        tags                                 = {
            "Name" = "DevOps Project"
        }
      ~ vpc_security_group_ids               = [
          - "sg-01b693649eaadeb8e",
        ] -> (known after apply)
        # (30 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # aws_security_group.instance_sg must be replaced
-/+ resource "aws_security_group" "instance_sg" {
      ~ arn                    = "arn:aws:ec2:eu-north-1:713201898775:security-group/sg-01b693649eaadeb8e" -> (known after apply)
      ~ description            = "Allow SSH and HTTP" -> "Allow SSH, HTTP, and app ports" # forces replacement
      ~ id                     = "sg-01b693649eaadeb8e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 3001
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3001
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9100
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9100
            },
            # (4 unchanged elements hidden)
        ]
        name                   = "instance_sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "713201898775" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_repository.Deepak will be updated in-place
  ~ resource "github_repository" "Deepak" {
      - has_issues                  = true -> null
        id                          = "DevOps-Project"
        name                        = "DevOps-Project"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.web will be updated in-place%0A  ~ resource "aws_instance" "web" {%0A        id                                   = "i-09e147c3c46d08b03"%0A        tags                                 = {%0A            "Name" = "DevOps Project"%0A        }%0A      ~ vpc_security_group_ids               = [%0A          - "sg-01b693649eaadeb8e",%0A        ] -> (known after apply)%0A        # (30 unchanged attributes hidden)%0A%0A        # (9 unchanged blocks hidden)%0A    }%0A%0A  # aws_security_group.instance_sg must be replaced%0A-/+ resource "aws_security_group" "instance_sg" {%0A      ~ arn                    = "arn:aws:ec2:eu-north-1:713201898775:security-group/sg-01b693649eaadeb8e" -> (known after apply)%0A      ~ description            = "Allow SSH and HTTP" -> "Allow SSH, HTTP, and app ports" # forces replacement%0A      ~ id                     = "sg-01b693649eaadeb8e" -> (known after apply)%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 3001%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 3001%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 9090%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 9090%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 9100%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 9100%0A            },%0A            # (4 unchanged elements hidden)%0A        ]%0A        name                   = "instance_sg"%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "713201898775" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ tags_all               = {} -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # github_repository.Deepak will be updated in-place%0A  ~ resource "github_repository" "Deepak" {%0A      - has_issues                  = true -> null%0A        id                          = "DevOps-Project"%0A        name                        = "DevOps-Project"%0A        # (33 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```